[
  {
    "id": "53499",
    "title": "Merge Shooter",
    "description": "In Merge Shooter, defend the galaxy by merging turrets to fight off alien invaders. Enhance your defense with special powers, navigating through levels filled with challenges. With its colorful graphics and user-friendly interface, its an exciting adventure for all ages. Become the galaxys hero by proving your achievements in this dynamic gameplay experience.",
    "instructions": "Left Mouse Button",
    "url": "https://html5.gamemonetize.com/9h8tef65vztebvjwbojpzwa8qvps601k/",
    "category": "Shooting",
    "tags": "Action, Casual, Strategy, Tower Defense",
    "thumb": "https://img.gamemonetize.com/9h8tef65vztebvjwbojpzwa8qvps601k/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "53648",
    "title": "Survivor Rainbow Monster",
    "description": "Im Red Monster - your guide in this Survivor In Rainbow Monster io game. The first mobile version of Rainbow Game. In Survivor In Rainbow Monster mobile game, you play as an unnamed child who has been kidnapped during a school trip to an amusement park called Spooky park. No more playtime. From the moment of your capture, you must survive five nights in the strange location that&rsquo;s entirely empty of life except for you and the Rainbow Monster. Five nights, with each evening consisting of a special task or challenge you must complete while avoiding the Rainbow Monsters. It&rsquo;s playtime! YOUR MISSION - RAINBOW GAME MODE Night 1: Find the Bl",
    "instructions": "keyboards and E - mouse- Touchpad ",
    "url": "https://html5.gamemonetize.com/j9e3ilf24811tta0asopzhewn4s8k086/",
    "category": "Hypercasual",
    "tags": ".io Games, Action, Adventure, Brain, Monster, monstertruck",
    "thumb": "https://img.gamemonetize.com/j9e3ilf24811tta0asopzhewn4s8k086/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "5347",
    "title": "Motorcycle and Girls Puzzle",
    "description": "Play with 6 images in this perfect jigsaw puzzle game: Motorcycle and Girls Puzzle. All images is with the motorcycle and girls. Solve all puzzles and keep your brain sharp. You have four modes for each picture, 16 pieces, 36 pieces, 64 pieces and 100 pieces. Enjoy and have fun.",
    "instructions": "Use mouse to play this html5 games ",
    "url": "https://html5.gamemonetize.com/f1222dyja0b935aivtd2ha3b0ui8la81/",
    "category": "Puzzle",
    "tags": "Moto, Motorcycle",
    "thumb": "https://img.gamemonetize.com/f1222dyja0b935aivtd2ha3b0ui8la81/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "53591",
    "title": "1010 Elixir Alchemy",
    "description": "Enter the enchanting world of 1010 Elixir Alchemy, where strategic placement reigns supreme. Strategically place Tetris-style blocks on a 10x10 grid to collect Elixirs. Complete rows or columns to gather Elixirs. If the grid fills up with remaining Elixirs, its game over. With 60 levels, master the art of alchemy in this addictive adventure!",
    "instructions": "Use a mouse or touchpad to play this game ",
    "url": "https://html5.gamemonetize.com/pk860amap871zndrbke2evkewv8z5g2c/",
    "category": "Puzzle",
    "tags": "Block, Collecting, Fantasy, Puzzle, Skill, Tetris",
    "thumb": "https://img.gamemonetize.com/pk860amap871zndrbke2evkewv8z5g2c/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "41957",
    "title": "Farm Shadow Match",
    "description": "This is an educational and fun game which enhances both finding and matching skills. This game creates fun of both hidden object and shadow matching game. You need to search matching item for given shadow in the left panel. Complete the level before time runs out to get bonus points.",
    "instructions": "Use mouse or touch pad to play this game ",
    "url": "https://html5.gamemonetize.com/tj0iefk80f10enhcw2ru8jjaezs718dv/",
    "category": "Puzzle",
    "tags": "Educational, Hidden, HTML5, Mobile, Puzzle",
    "thumb": "https://img.gamemonetize.com/tj0iefk80f10enhcw2ru8jjaezs718dv/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "892",
    "title": "Toilet Rush",
    "description": "Toilet rush is a puzzle platmer game.Find your way and dump your load on the lavatory before you explode. It's a everyday struggle to find peace on toilet.",
    "instructions": "Mouse or Touch and arrow key to move",
    "url": "https://html5.gamemonetize.com/jbfqqewsrr8ru56d5zbfxtr4ein5mrq5/",
    "category": "Stickman",
    "tags": "Fun, Funny, kiz10",
    "thumb": "https://img.gamemonetize.com/jbfqqewsrr8ru56d5zbfxtr4ein5mrq5/512x384.jpg",
    "width": "800",
    "height": "500"
  },
  {
    "id": "4799",
    "title": "Animal Babies",
    "description": "Click the cards to reveal an animal baby. Memorize their locations so that you can match to similar cards. Match all of the cards on the board to complete the level.",
    "instructions": "Tap the card to reveal it ",
    "url": "https://html5.gamemonetize.com/saww125d4a2d2jxrxzhx4sa1wx2crldk/",
    "category": "Puzzle",
    "tags": "Animal, Baby, Card, Fun, HTML5, Kids, Matching, Memory, Mobile, Puzzle",
    "thumb": "https://img.gamemonetize.com/saww125d4a2d2jxrxzhx4sa1wx2crldk/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "17952",
    "title": "Stars Strike",
    "description": "Stars Striking is a addictive Block removal puzzle game. In this game player will have a master block that can be moved left or right by tapping or clicking on the screen. Move your master block and position on to its identical block to remove the entire row. Keep striking star troops as they are moving fast to the end point. If the block touches the upper corner of screen, the game will over.",
    "instructions": "Use mouse or touch pad to play this game ",
    "url": "https://html5.gamemonetize.com/7rgjdes9i3446k3a33y8xqbz0u4knrjv/",
    "category": "Clicker",
    "tags": "Arcade, Block, HTML5, Matching, Mobile, Puzzle, Space",
    "thumb": "https://img.gamemonetize.com/7rgjdes9i3446k3a33y8xqbz0u4knrjv/512x384.jpg",
    "width": "420",
    "height": "700"
  },
  {
    "id": "20748",
    "title": "Candy Matching",
    "description": "Swap adjacent blocks to line up 3 or more of the same type of candies next to each other horizontally or vertically to make a match. Each time you make a match tile will change its color. To clear a level make all the tiles bright.",
    "instructions": "Swipe your fingers on 2 nearby blocks or swipe mouse pointers ",
    "url": "https://html5.gamemonetize.com/7owoixaf4ah4kg1c1hypwuwowjqmlrgt/",
    "category": "Girls",
    "tags": "Candy, Girls, HTML5, Match-3, Matching, Mobile, Puzzle",
    "thumb": "https://img.gamemonetize.com/7owoixaf4ah4kg1c1hypwuwowjqmlrgt/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "7630",
    "title": "Space Pic Puzzler",
    "description": "'Space pic puzzler' is a interesting photo puzzle game. Playing this game is very simple. Using the touch swipe or mouse swipe, swap the pieces of a picture which are horizontally or vertically adjacent. Keep swapping the pieces until you get success in forming the whole picture. The target picture is shown in the left panel. Each second is reducing your score, so complete it as soon as possible.",
    "instructions": "Use mouse or touch pad to play this game ",
    "url": "https://html5.gamemonetize.com/xbs7sbge57zdnsqj1sxuz3c9so29usar/",
    "category": "Puzzle",
    "tags": "Arcade, HTML5, Jigsaw, Mobile, Puzzle, Space",
    "thumb": "https://img.gamemonetize.com/xbs7sbge57zdnsqj1sxuz3c9so29usar/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "6394",
    "title": "My Car Jigsaw",
    "description": "Fantastic Jigsaw game with car adventure. Drag and drop the picture pieces to their exact locations.",
    "instructions": "Use mouse or touch screen to play this game ",
    "url": "https://html5.gamemonetize.com/zwcdivhtk8mzdruwvzdl8jb0szmw94y9/",
    "category": "Puzzle",
    "tags": "Arcade, HTML5, Jigsaw, Kids, Mobile, Puzzle",
    "thumb": "https://img.gamemonetize.com/zwcdivhtk8mzdruwvzdl8jb0szmw94y9/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "5279",
    "title": "Find the Odd 2 ",
    "description": "It is a colorful puzzle game, in which you need to find 1 different item from a group of 4 items. To find accurate different item, you must follow the hint displayed in the screen. If you catch the different item before 25 seconds, you will get time bonus. Complete all 30 levels to win the game.",
    "instructions": "Use mouse to touch the items ",
    "url": "https://html5.gamemonetize.com/oytlhx0qpt6r10hyon9xcg54f34lujli/",
    "category": "Puzzle",
    "tags": "Board, Educational, Hidden, HTML5, Kids, Mobile, Puzzle, School",
    "thumb": "https://img.gamemonetize.com/oytlhx0qpt6r10hyon9xcg54f34lujli/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "53926",
    "title": "Math Rockets Averaging",
    "description": "In this game, youll have the opportunity to enhance your problem-solving skills and mathematical abilities. Your objective is simple: solve a series of averaging expressions by tapping the rocket and revealing the correct answer. With 10 expressions to solve in each level and 8 exciting challenges awaiting you, this game is designed to help you sharpen your math skills.",
    "instructions": "Use a mouse or touchpad to play this game ",
    "url": "https://html5.gamemonetize.com/apstn8y9id0hzvs8qr7z8cj18phz0uum/",
    "category": "Puzzle",
    "tags": "Educational, HTML5, Logic, Math, Mobile, Quiz, Rocket, Skill",
    "thumb": "https://img.gamemonetize.com/apstn8y9id0hzvs8qr7z8cj18phz0uum/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "3885",
    "title": "Bubble Shooter Easter",
    "description": "Bubble Shooter Easter is a Classical bubble shooter game with many new items and power ups. Aim and release the Egg in order to combine it with other similar Eggs. Use power-ups to overcome the challenges.",
    "instructions": "Use mouse or touchscreen to play this game ",
    "url": "https://html5.gamemonetize.com/zpk81m887ez6j3ipaz7tk5uur953ro9r/",
    "category": "Clicker",
    "tags": "Bubble, Bubble Shooter, Casual, Collecting, Easter, Girls, Mobile",
    "thumb": "https://img.gamemonetize.com/zpk81m887ez6j3ipaz7tk5uur953ro9r/512x384.jpg",
    "width": "800",
    "height": "480"
  },
  {
    "id": "27136",
    "title": "Food Junction",
    "description": "It is move and match game where you need to remove all the items from board by making a row or column of 3 similar items. To move items, first tap the item and then tap on target blank tile. If there is no blocker, the item will move to that tile. If any move makes a group of 3 or more similar items then those items will be removed from block. Make fewer moves for better score.",
    "instructions": "Use mouse or touch pad to play this game ",
    "url": "https://html5.gamemonetize.com/kyz6sovs9k9av4ki9lu9hpb0ocl430sz/",
    "category": "Puzzle",
    "tags": "Arcade, Food, Match-3, Matching, Puzzle",
    "thumb": "https://img.gamemonetize.com/kyz6sovs9k9av4ki9lu9hpb0ocl430sz/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "25431",
    "title": "Kingdom Tower Defense",
    "description": "Take control of the magic king and use your Skills to defend your castle from incoming enemy units. Engage in an epic battle to savethe kingdom with your heroes and magic from the monsters and enemies. Collect money to upgrade your weapons and buy new power upsbefore the final boss reach your castle. Use many special powers to stop the hordes and save the world in this fantasy defense game. Defend your tower from a wave of enemies that seek to invade and colonize your kingdom! Improve your weapons and properties to resist the terrible monsters much longer.",
    "instructions": "Point and shoot with the mouse on desktopTouch the screen to aim and shoot on mobile devices ",
    "url": "https://html5.gamemonetize.com/13fbwj9nn17h14l0uwyqf37b50dipusw/",
    "category": "Adventure",
    "tags": "Adventure, Defense, Tower Defense",
    "thumb": "https://img.gamemonetize.com/13fbwj9nn17h14l0uwyqf37b50dipusw/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "7640",
    "title": "Rage Road Online",
    "description": "Join the brave cowboy in an extreme chase in Rage Road Online play for free first here on kiz10.com !!!! If you are a brave player who does not reject an adventure, this exclusive game from kiz10 is for you !!! Join the fun and remember that we have the best collection of games with rewards and kizkoins on kiz10. Rage Road Online is the best car shooting game !! Shoot all the enemies and destroy their vehicles, collect coins and unlock many hat costumes. Each hat has different special abilities. So drive your car on the road, rampage, shoot and destroy all enemies!",
    "instructions": "Use the mouse to aim and shoot or touch the screen",
    "url": "https://html5.gamemonetize.com/h1ayvkq968i9j6didymsbzv76lk1g01y/",
    "category": "Shooting",
    "tags": "Action, kiz10, Racing, Shooter",
    "thumb": "https://img.gamemonetize.com/h1ayvkq968i9j6didymsbzv76lk1g01y/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "42813",
    "title": "ChooChoo Charles Friends Defense",
    "description": "If youre looking for a heart-pounding, time-sucking online action game, go no farther than Choo-Choo Charles Friends Defense! Players of this engrossing game will find themselves immersed in a terrifying realm of train games. Defend the train as the courageous Choo-Choo Charles from the terrifying Rainbow Monster and its terrible henchmen. There is a lot at risk, so your reflexes and ability to strategize will be tested to the limit. Defeat wave after wave of foes by strengthening your defenses and gaining access to devastating powers.",
    "instructions": "PC controls Use the mouse to shoot Touch controls touch the screen to shoot",
    "url": "https://html5.gamemonetize.com/5bsheg26uutci2x11kw4s9enwmse2kuh/",
    "category": "Adventure",
    "tags": "Highscore, kiz10, Shooting, survival",
    "thumb": "https://img.gamemonetize.com/5bsheg26uutci2x11kw4s9enwmse2kuh/512x384.jpg",
    "width": "800",
    "height": "550"
  },
  {
    "id": "1861",
    "title": "Stickman Street Fighter 3D",
    "description": "It is time to fight in kz10 !! Choose your favorite stickman and perform awesome combos to take the opponents down! Even more awesome is to be the one in the middle who kicks everyone\u0092s ass. In Stickman Ultimate StreetFighter 3D, an amazing reaction fighting game, you have to act really fast to throw punches and kicks in perfect timing to avoid getting beat up by hundreds of enemies. Clear 100 levels to unlock the endless mode. There are different kinds of enemies and over 20 weapons. Enjoy Stickman Ultimate StreetFighter 3D, a free online game!",
    "instructions": "Z Attack X Attack C Defend SPACE Jump",
    "url": "https://html5.gamemonetize.com/r5tug67vf8lprllpnawokwa3p0xddr45/",
    "category": "Action",
    "tags": "Fight, Fighting, kiz10, Stickman, Street Fighting",
    "thumb": "https://img.gamemonetize.com/r5tug67vf8lprllpnawokwa3p0xddr45/512x384.jpg",
    "width": "900",
    "height": "600"
  },
  {
    "id": "28475",
    "title": "Stick Shadow Fighter Legacy",
    "description": "Have fun with this entertaining new game called Stick Shadow Fighter Legacy enjoy an action game, adventure accompanies your favorite stickman and help him get as far as you can! Play it now at kiz10.com totally free and enjoy this and many other fighting games. A new mission begins where the little stickman needs your ability to fight and jump the obstacles of a dungeon full of dangerous objects and enemies that will not hesitate to eliminate you! Destroy the robots, dodge the fragile bricks, jump at the right time to avoid falling. The objective of the game is to go as far as you can to accumulate a better score and thus be able to go as far as possible by improving your fighting skills !! Unlock new avatars to evolve your character.",
    "instructions": "Instructions Use the mouse right click to jump or touch the game buttons on mobile devices ",
    "url": "https://html5.gamemonetize.com/z5xczcpconjvfj8o8i6lretlw1f36cob/",
    "category": "Adventure",
    "tags": "Dragon Ball Z, Fighting, kiz10, Stickman",
    "thumb": "https://img.gamemonetize.com/z5xczcpconjvfj8o8i6lretlw1f36cob/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "53524",
    "title": "GTA New York",
    "description": "This amazing 3D game is a free online take on the legendary Grand Theft Auto game. As you play, youll take control of a thief with assignments all throughout New York City. You have complete freedom to run and explore the games open world. Using the arrows to guide you to the control points, you must sprint across the city and complete over ten interactive levels.",
    "instructions": "Controls WASD to moveMouse to move the camera Click Left Shoot Click Right AimF InteractR ReloadESC for menuSPACEBAR JumpCTRL Run",
    "url": "https://html5.gamemonetize.com/zt4qt847w9o5z06a4ayj5kwy2p9eyifi/",
    "category": "Action",
    "tags": "3D, Car, kiz10, Shooting",
    "thumb": "https://img.gamemonetize.com/zt4qt847w9o5z06a4ayj5kwy2p9eyifi/512x384.jpg",
    "width": "900",
    "height": "600"
  },
  {
    "id": "1644",
    "title": "Jingle Jetpack",
    "description": "The most exciting action game is back to help Santa to deliver all gifts. Strap on a bullet-powered jetpack to dodge lasers, electric fields and all the missiles that come your way. You need to get out of there alive! Collect coins and buy new power ups and skins to reach new scores and deliver all Chritsmas to the world",
    "instructions": "Mouse or Touch for Play",
    "url": "https://html5.gamemonetize.com/1h0rpfwt512uknlm2so880g153siow4p/",
    "category": "Adventure",
    "tags": "2D, Action, kiz10",
    "thumb": "https://img.gamemonetize.com/1h0rpfwt512uknlm2so880g153siow4p/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "33279",
    "title": "Mr Noob Pro Archer",
    "description": "Have fun with this new action game Mr Noob Pro Archer is an archery game where the little noob must shoot his arrows at the enemies that arrive to eliminate you !!! Can you help eliminate with your bow and arrow? Try it on kiz10 totally free. One day like another, a little noob will meet multiple enemies who want to eliminate you, they will not hesitate to hurt you with their arrows or swords, can you stop them? This is a new game where the little noob archer must eliminate the enemies with his bow and arrow!! Objectives Eliminate all the enemies that will be located in different positions of the levels, improve your score with each elimination, collect all the gold you can, try as many times as you want and enjoy a casual action game.",
    "instructions": "Instructions Aim and shoot with the mouse right click on PCOn mobile and tablet devices touch the screen to aim and release to shoot ",
    "url": "https://html5.gamemonetize.com/4czbh2hebirs7du5a5s1dy9gkwnma3ea/",
    "category": "Arcade",
    "tags": "Hypercasual, kiz10, Minecraft, Shoot",
    "thumb": "https://img.gamemonetize.com/4czbh2hebirs7du5a5s1dy9gkwnma3ea/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47354",
    "title": "Super Mario Wonder",
    "description": "Super Mario Wonder is an exciting online game set in the magical world of Mario, where players embark on an epic journey to help Mario conquer various castles. Offering an engaging mix of action and fun, this game has become a favorite among casual gamers seeking thrilling gameplay without the need for downloads or installations. Best of all, Super Mario Wonder can be enjoyed entirely for free on the popular gaming platform, kiz10.com. Casual gamers are often drawn to games that provide instant entertainment without the complexities of traditional titles. Website Developer <a href='https://kiz10.com'>https://kiz10.com</a>",
    "instructions": "PC controls Use the mouse to jump Touch controls touch the screen to jump",
    "url": "https://html5.gamemonetize.com/zk99zkldgfzm89l2g56hhf5rfzitm9x8/",
    "category": "Clicker",
    "tags": "kiz10, Mario, Platform, run",
    "thumb": "https://img.gamemonetize.com/zk99zkldgfzm89l2g56hhf5rfzitm9x8/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "47274",
    "title": "Rainbow Monster Impostor Catcher",
    "description": "Look no further than Rainbow Monster Impostor Catcher! In this thrilling game, youll take control of Rainbow Blue as you embark on a mission to capture the mischievous Among Us characters before time runs out. With its captivating gameplay and addictive challenges, Rainbow Monster Impostor Catcher guarantees hours of fun and entertainment. Whether youre a fan of strategy games, action-packed adventures, or puzzle-solving quests, this game has it all. Website Developer <a href='https://kiz10.com'>https://kiz10.com</a>",
    "instructions": "Computer controls Use the mouse to select items move with the WASD and Spacebar keys to attack Touch controls Tap the game buttons to move around the map and attack ",
    "url": "https://html5.gamemonetize.com/izpx2q93ri3o86i81yqoh7zy4gj2dqqn/",
    "category": "Hypercasual",
    "tags": "Escape, kiz10, run, Timing",
    "thumb": "https://img.gamemonetize.com/izpx2q93ri3o86i81yqoh7zy4gj2dqqn/512x384.jpg",
    "width": "800",
    "height": "500"
  },
  {
    "id": "46069",
    "title": "Mine Noob Maze",
    "description": "Mine Noob Maze is a casual game that has been gaining popularity among online game enthusiasts. Developed by Kiz, this game offers hours of fun and entertainment to players who love solving puzzles and exploring new worlds. It is a free online game that is easy to play, and is suitable for both kids and adults. Website Developer <a href='https://kiz10.com'>https://kiz10.com</a>",
    "instructions": "PC controls Use the arrow keys to move around the map Touch controls Touch and slide to move around the map",
    "url": "https://html5.gamemonetize.com/6j2pc7jglv10j2a7n9v7yr4cq96ghpuz/",
    "category": "Hypercasual",
    "tags": "kiz10, Maze, Minecraft, Platform",
    "thumb": "https://img.gamemonetize.com/6j2pc7jglv10j2a7n9v7yr4cq96ghpuz/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "1532",
    "title": "Jump Will Jump",
    "description": "Jump, dash, use various weapons to maul everything on your way with only one control. A simple game and addictive to play. Reach the highest score you can and collect cool costumes your hero!",
    "instructions": "Use Mouse Right Click or Touch screen for advence",
    "url": "https://html5.gamemonetize.com/t93yw35gjjvle0qbk7qkthx8z0ekmeqg/",
    "category": "Clicker",
    "tags": "Adventure, Jumping",
    "thumb": "https://img.gamemonetize.com/t93yw35gjjvle0qbk7qkthx8z0ekmeqg/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "6790",
    "title": "Super Wario Riders",
    "description": "Join in a race in the world of mushrooms and magic stars, select and play with any of Mario's friends, Luigi, Toadette or Toad, help them get safely to the castles on each level to be one step closer to rescuing the beautiful princess from Bowser's claws !!",
    "instructions": "Mouse or Touch For Play",
    "url": "https://html5.gamemonetize.com/sly30piwilci61j7pc5x8n36cdu9n19f/",
    "category": "Adventure",
    "tags": "Kiz 10, kiz10, Mario",
    "thumb": "https://img.gamemonetize.com/sly30piwilci61j7pc5x8n36cdu9n19f/512x384.jpg",
    "width": "800",
    "height": "480"
  },
  {
    "id": "46896",
    "title": "Thief Puzzle Online",
    "description": "Are you ready to embark on a thrilling adventure with a stickman thief? Look no further than Thief Puzzle Online, an exciting online game that combines puzzles and action-packed gameplay. In this game, your mission is to help the stickman thief retrieve precious objects while navigating through challenging levels. Best of all, you can enjoy this game for free on Kiz10.com! Thief Puzzle Online falls into the category of casual games, which are known for their accessibility and entertainment value.Website Developer <a href='https://kiz10.com'>https://kiz10.com</a>",
    "instructions": "PC controls Use the mouse to move the handTouch controls Touch the screen to drag your hand",
    "url": "https://html5.gamemonetize.com/2mb4bxmkp1l8xg3j6ebc58w1n960rc99/",
    "category": "Clicker",
    "tags": "Funny, Hypercasual, Kiz 10, Point And Click, Puzzle, Thief",
    "thumb": "https://img.gamemonetize.com/2mb4bxmkp1l8xg3j6ebc58w1n960rc99/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "2692",
    "title": "Stickman Armed Assassin 3D",
    "description": "Stickman Armed Assassin! Get ready for big shootout! Become the best stickmen! This game contains lots of blood and killing, so you know it will be awesome! - Awesome 3D levels and variety of stickman enemies! - Lot of weapons to chose from! - Ragdoll - based death animations - Survive through many missions: kill stickman enemies, find bombs, rescue the civilians, fight zombies. - Become the dealer of death, the destroyer of worlds! Become the ultimate stickman assassin - unleash your anger!",
    "instructions": "W A S D to walk around Mouse to Look around Left Mouse Button to Fire Right Mouse Button to Aim Mouse Wheel To Change Weapons G for Grenades R to Reload Left Shift to Run Left CTRL to Crouch X to Prone V to Melee Space to ",
    "url": "https://html5.gamemonetize.com/qslkqx2es38ajxhg8iik4smmn16e75px/",
    "category": "Action",
    "tags": "Kiz 10, kiz10, Stickman",
    "thumb": "https://img.gamemonetize.com/qslkqx2es38ajxhg8iik4smmn16e75px/512x384.jpg",
    "width": "960",
    "height": "600"
  },

  {
    "id": "8417",
    "title": "Among us The imposter",
    "description": "Play Now Among Us The Imposter a new game exclusive to kiz10.com !! with many achievements to unlock very fun within our website, again the little characters of Among Us start a new adventure now each of the characters will have the opportunity to reach the goal of each level safely and securely, very complicated levels with levels of much more complex difficulty in each level. Have fun with this excellent new game here at kiz10 where we have a selection of Among us games totally free. The little characters of Among Us are trapped in a strange dimension, but that won't stop the lovable characters who want to master this new adventure in a strange world full of dangerous objects. The objective of the game is to control the characters of among us and help them to run through the dangerous platforms of each level, jump at the right moment, to avoid the dangerous blades that are on the ground or that are stuck on the platforms, many obstacles on your way you must help the little characters to arrive safely in each level. On your way and trajectory you will be able to collect many points to improve your ranking within the Kiz10 community and show that you are a true gammer. In this game you will have the possibility of unlocking many rewards that will make the game much more entertaining and fun.",
    "instructions": "Use Arrow or Touch and Slide ",
    "url": "https://html5.gamemonetize.com/c9kub5ivqm7fxsigqwngk5kap0ny310g/",
    "category": "Hypercasual",
    "tags": "Adventure, jump, Kiz 10, kiz10, running",
    "thumb": "https://img.gamemonetize.com/c9kub5ivqm7fxsigqwngk5kap0ny310g/512x384.jpg",
    "width": "800",
    "height": "480"
  },
  {
    "id": "50498",
    "title": "Super Traffic Racer",
    "description": "Super Traffic Racer is a milestone in the genre of endless arcade racing. Drive your car through highway traffic, earn cash, upgrade your car, and buy new ones. Try to be one of the fastest drivers in the global leaderboards. Endless racing is now redefined!",
    "instructions": "Touch the screen or use the arrow keys",
    "url": "https://html5.gamemonetize.com/a5w7favv4e53hhyfev78m7xs0dcefnew/",
    "category": "Racing",
    "tags": "1 Player, 3D, 3D Games, Action, Arcade, Best Games, Cars, Casual, Traffic",
    "thumb": "https://img.gamemonetize.com/a5w7favv4e53hhyfev78m7xs0dcefnew/512x384.jpg",
    "width": "800",
    "height": "480"
  },
  {
    "id": "44261",
    "title": "Skibidi Elastic Head",
    "description": "In the entertaining puzzle game Skibidi Elastic Head, your goal is to assist the Skibidi Toilet in escaping from the cameraman and completing each level. Play the part of a courageous skibidi toilet and see if you can elude the camera crew. Make sure you finish each level before the alarm goes off; if you do, youll get a lot of cash, but if you pause for too long, youll be caught and killed. You may access a wide variety of skins for your skibidi, including characters from Rick and Morty, Five Nights at Freddys, Monster Rainbow, and many more.Website Developer <a href='https://kiz10.com'>https://kiz10.com</a>",
    "instructions": "DESKTOP CONTROLS Use the mouse to stretch the skibidi toilets head across the map TOUCH CONTROLS Tap the screen to stretch the skibidi toilets head across the map ",
    "url": "https://html5.gamemonetize.com/mzhcqhok1b5whltst1sscbgd85ewzn2q/",
    "category": "Clicker",
    "tags": "Interactive, kiz10, Levels, Puzzle",
    "thumb": "https://img.gamemonetize.com/mzhcqhok1b5whltst1sscbgd85ewzn2q/512x384.jpg",
    "width": "900",
    "height": "500"
  },
  {
    "id": "1546",
    "title": "Criatures Defense",
    "description": "Get ready to defend your fortress against powerful waves of various units. They form huge waves of deadly enemies, that will erase your fortress if you won't stop them. Use primary gun to shoot them, additional system will do it automatically. Activate weapons from the bottom panel for targeted strike. Complete levels and upgrade.",
    "instructions": "Mouse or Touch for Play",
    "url": "https://html5.gamemonetize.com/v6n37gn8393blfz7dmoeublre91e9zu5/",
    "category": "Shooting",
    "tags": "Action, Fight, kiz10, Shooting",
    "thumb": "https://img.gamemonetize.com/v6n37gn8393blfz7dmoeublre91e9zu5/512x384.jpg",
    "width": "800",
    "height": "500"
  },
  {
    "id": "33826",
    "title": "Mr noob Jailbreak",
    "description": "Have fun with this entertaining new game Mr noob Jailbreak try to escape from the prison guards and go as far as possible with the best score, jump, slide and shoot the enemy guards and weapons !! You can play it for free on kiz10 and enjoy many other new games. A brave little noob decided to escape from prison, run through the roofs of the buildings and try to get as far as possible, but he ran into many guards and potential enemies that will eliminate you if you don't react quickly. Control the movements of the little noob to go far with the best score jump, shoot use the slowmotion to improve your aim. Have fun with this casual game and many others for free. KEY FEATURESFeatures: Adventure game, action and shooting. Casual jump and shoot game Minecraft based game You can play it on PC, Tablets and mobiles",
    "instructions": "Instructions Right click to shoot use the W key to jump S to slide and spacebar to use slowmotion On mobile devices and tablets use the touch game buttons ",
    "url": "https://html5.gamemonetize.com/aghhqhf3kc5px6s55hyg2igj5f9pc5za/",
    "category": "Hypercasual",
    "tags": "kiz10, running, Shooting, weapons",
    "thumb": "https://img.gamemonetize.com/aghhqhf3kc5px6s55hyg2igj5f9pc5za/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "2423",
    "title": "Slendrina Must Die: The Asylum",
    "description": "Slendrina Must Die is back in a new scary adventure! The Asylum! She is much more angry then usual. Be careful, she is protecting something. Also, watch out for Slendrina's Mother! She is one old evil witch ! Find 8 Old Medical Books in the Abandoned Asylum. Three weapons: - Gun - MP5 - Shotgun",
    "instructions": "W A S D to walk around Mouse to Look around Left Mouse Button to Fire Right Mouse Button to Aim Mouse Wheel To Change Weapons G for Grenades R to Reload F to Pickup Items Left Shift to Run Left CTRL to Crouch X to Prone V to Melee ",
    "url": "https://html5.gamemonetize.com/3c8kwxl3kmav9k5ac06nei520fsgq3gu/",
    "category": "Adventure",
    "tags": "3D, 3D Games, kiz10, Unity3D",
    "thumb": "https://img.gamemonetize.com/3c8kwxl3kmav9k5ac06nei520fsgq3gu/512x384.jpg",
    "width": "960",
    "height": "600"
  },
  {
    "id": "52072",
    "title": "Scary Baby in Yellow",
    "description": "Have fun with this 3D horror game with a lot of suspense. Scary Baby in Yellow is a game of intrigue, terror, search, levels, and a lot of fun. Follow the instructions and try to find the scared yellow baby. Take him where the instructions tell you to. Complete all the levels of this game; you will have a time limit for each of the games. If you do not complete the level, you will lose your progress and have to do it again. Website Developer <a href='https://kiz10.com/'>https://kiz10.com/</a>",
    "instructions": "Controls Use the arrows of the keyboard to move Use the mouse to look around you F to grab objects",
    "url": "https://html5.gamemonetize.com/e6h8mfab32i7fs0p8lu85k5packxhyfx/",
    "category": "Clicker",
    "tags": "Baby, Escape, Horror, kiz10",
    "thumb": "https://img.gamemonetize.com/e6h8mfab32i7fs0p8lu85k5packxhyfx/512x384.jpg",
    "width": "900",
    "height": "600"
  },
  {
    "id": "47984",
    "title": "Yasin Cengiz Game",
    "description": "Help the Tiktoker Yasin to catch all the food in a rushtime. Eat all food and dont let fall or you will lose a life. Evade the bombs and dont let the food fall, collect cash and coins to buy power ups, more speed, special powers and more to reach the highest scores.Website Developer <a href='https://kiz10.com'>https://kiz10.com</a>",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/g1ut0m8pmc3fb0nznardzk2xhc4z3pti/",
    "category": "Hypercasual",
    "tags": "1 Player, Action, Balance, Burger, Casual, Click, Dancing, Fun, Funny, Hypercasual",
    "thumb": "https://img.gamemonetize.com/g1ut0m8pmc3fb0nznardzk2xhc4z3pti/512x384.jpg",
    "width": "480",
    "height": "800"
  },
  {
    "id": "49886",
    "title": "Toilet Monster Evolution",
    "description": "In this gripping Monster Evolution, your ultimate objective is to defeat and merge monsters lurking in every corner. You will face a series of thrilling obstacles that will test your mobility and strategic thinking. They will launch attacks from all directions, their spine-chilling cries reverberating through the atmosphere. Its a fight for survival, and you are the sole individual capable of enduring it.Website Developer <a href='https://kiz10.com'>https://kiz10.com</a>",
    "instructions": "Use the mouse or touch to control the player",
    "url": "https://html5.gamemonetize.com/plobtg9uk627hqijunt3sdchtbpqa3qv/",
    "category": "Arcade",
    "tags": "1 Player, 2D, Action, Adventure, Arcade, Best Games, Casual, Cool, endless, Games, HTML5, Skibidi, Skibidi Toilet",
    "thumb": "https://img.gamemonetize.com/plobtg9uk627hqijunt3sdchtbpqa3qv/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "23607",
    "title": "Teen Titans Go ! Swamp Attack",
    "description": "Have fun playing Titan Swamp Attack, an exclusive new game where you will enjoy playing an adventure in the swamp full of enemies of all kinds, monsters, robots that will try to eliminate you !!!! Have fun with this new game from taptapking.com totally free. Help the little titan to save the world from a terrible attack that begins in the swamp, a terrible boss took the swamp by ce and wants to start the destruction of the world !!! But luckily the little titans have the help of your skills to save the world. The objective of the game is to control the super heroes so that they can run, jump, attack and shoot the enemies that arrive from all sides. Complete each mission and improve your score, accumulate coins to improve your skills speed, strength, weapons.",
    "instructions": "Use the mouse and keyboard on the computer Use the arrows to move jump use the mouse to attack and shoot On mobile devices use the game buttons ",
    "url": "https://html5.gamemonetize.com/3cy0vt0b9kfq8mb29luamene4htepa2y/",
    "category": "Adventure",
    "tags": "Adventure, Fighting, running",
    "thumb": "https://img.gamemonetize.com/3cy0vt0b9kfq8mb29luamene4htepa2y/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "14156",
    "title": "Easter Bunny Slide",
    "description": "Play this slide puzzle games of the Easter Bunny. It's include 3 images and 3 modes (3x3 pieces, 4x4 pieces, 5x5 pieces) to play.",
    "instructions": "Use mouse to play this html5 games ",
    "url": "https://html5.gamemonetize.com/u8rtp2zm4jclptu2y5czxwjf6cjm0shv/",
    "category": "Puzzle",
    "tags": "Easter, HTML5, Mobile, Rabbit",
    "thumb": "https://img.gamemonetize.com/u8rtp2zm4jclptu2y5czxwjf6cjm0shv/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "7923",
    "title": "Jokers Puzzle",
    "description": "Play with 6 images in this perfect jigsaw puzzle game: Jokers Puzzle. All images is with the jokers. Solve all puzzles and keep your brain sharp. You have four modes for each picture, 16 pieces, 36 pieces, 64 pieces and 100 pieces. Enjoy and have fun.",
    "instructions": "Use mouse to play this html5 games ",
    "url": "https://html5.gamemonetize.com/dbbz771n6k7r841y70ac91d8nhymn6p0/",
    "category": "Puzzle",
    "tags": "HTML5, Jigsaw, Mobile",
    "thumb": "https://img.gamemonetize.com/dbbz771n6k7r841y70ac91d8nhymn6p0/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "4261",
    "title": "Virus Mahjong Connection",
    "description": "Connect all the virus mahjong tiles and clear the board in this html5 mahjong connection games. What's the max level can you play?",
    "instructions": "Use mouse to play this html5 mahjong games ",
    "url": "https://html5.gamemonetize.com/yau3otx7sa4ki7x3463aks9rs5l2b4a9/",
    "category": "Puzzle",
    "tags": "Collection, HTML5, Mahjong, Mobile",
    "thumb": "https://img.gamemonetize.com/yau3otx7sa4ki7x3463aks9rs5l2b4a9/512x384.jpg",
    "width": "900",
    "height": "600"
  },
  {
    "id": "1964",
    "title": "Christmas Characters Slide",
    "description": "Play this slide puzzle games of the christmas characters. It's include 3 images and 3 modes to play.",
    "instructions": "Use mouse to play this html5 christmas games ",
    "url": "https://html5.gamemonetize.com/vslwqk60gjzipyq4sfs7atsxdnq2rh3m/",
    "category": "Puzzle",
    "tags": "Christmas, HTML5, Mobile",
    "thumb": "https://img.gamemonetize.com/vslwqk60gjzipyq4sfs7atsxdnq2rh3m/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "6896",
    "title": "Cartoon Autumn Puzzle",
    "description": "Play with 6 images in this perfect jigsaw puzzle game: Cartoon Autumn Puzzle. All images is with the cartoon autumn. Solve all puzzles and keep your brain sharp. You have four modes for each picture, 16 pieces, 36 pieces, 64 pieces and 100 pieces. Enjoy and have fun.",
    "instructions": "Use mouse to play this html5 games ",
    "url": "https://html5.gamemonetize.com/92k5kpklx3iuimmj7k5rb8slmfwxd3xn/",
    "category": "Puzzle",
    "tags": "HTML5, Jigsaw, Mobile",
    "thumb": "https://img.gamemonetize.com/92k5kpklx3iuimmj7k5rb8slmfwxd3xn/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "1320",
    "title": "Fruit Sudoku",
    "description": "Sudoku is a famous logic puzzle games. If you like sudoku games, this Fruit Sudoku games is for you. In Fruit Sudoku, you task is to fill all the cells with fruit. Each row, column or 3x3 cells must contain a fruit exactly once.",
    "instructions": "Use mouse to play this html5 sudoku games ",
    "url": "https://html5.gamemonetize.com/rpnmlvdgvuepxe9gezrexptly2wkhfb8/",
    "category": "Puzzle",
    "tags": "Fruit, Fruits, HTML5, Logic, Mobile, Sudoku",
    "thumb": "https://img.gamemonetize.com/rpnmlvdgvuepxe9gezrexptly2wkhfb8/512x384.jpg",
    "width": "1280",
    "height": "1920"
  },
  {
    "id": "4802",
    "title": "Race Cars Puzzle 2",
    "description": "Play with 6 images in this perfect jigsaw puzzle game: Race Cars Puzzle 2. All images is with the race cars. Solve all puzzles and keep your brain sharp. You have four modes for each picture, 16 pieces, 36 pieces, 64 pieces and 100 pieces. Enjoy and have fun.",
    "instructions": "Use mouse to play this html5 car jigsaw games ",
    "url": "https://html5.gamemonetize.com/ip8mtzooh6tij8pgb769jpegdjwi510o/",
    "category": "Puzzle",
    "tags": "Car, Cars, HTML5, Jigsaw, Mobile, Race",
    "thumb": "https://img.gamemonetize.com/ip8mtzooh6tij8pgb769jpegdjwi510o/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "2955",
    "title": "Volkswagen T-Roc R Puzzle",
    "description": "Play with 6 images in this perfect jigsaw puzzle game: Volkswagen T-Roc R Puzzle. All images is with the volkswagen t-roc r. Solve all puzzles and keep your brain sharp. You have four modes for each picture, 16 pieces, 36 pieces, 64 pieces and 100 pieces. Enjoy and have fun.",
    "instructions": "Use mouse to play this html5 puzzle games ",
    "url": "https://html5.gamemonetize.com/bbs7pnohw2to8vl87pd47ryw2eh14kvg/",
    "category": "Puzzle",
    "tags": "Car, Cars, HTML5, Jigsaw, Mobile",
    "thumb": "https://img.gamemonetize.com/bbs7pnohw2to8vl87pd47ryw2eh14kvg/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "3896",
    "title": "Easter Day Slide",
    "description": "Play this slide puzzle games of the easter. It's include 3 images and 3 modes to play.",
    "instructions": "Use mouse to play this html5 easter games ",
    "url": "https://html5.gamemonetize.com/g4lmoh13iaao4431x2n73m9u2rghc1os/",
    "category": "Puzzle",
    "tags": "Easter, Holiday, HTML5, Mobile",
    "thumb": "https://img.gamemonetize.com/g4lmoh13iaao4431x2n73m9u2rghc1os/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "4354",
    "title": "Monster Truck Puzzle",
    "description": "Play with 6 images in this perfect jigsaw puzzle game: Monster Truck Puzzle. All images is with monster truck. Solve all puzzles and keep your brain sharp. You have four modes for each picture, 16 pieces, 36 pieces, 64 pieces and 100 pieces. Enjoy and have fun.",
    "instructions": "Use mouse to play this html5 monster truck games ",
    "url": "https://html5.gamemonetize.com/b5sdqnlqam9cqb6kbona6flqh8tq6m0h/",
    "category": "Puzzle",
    "tags": "Car, Cars, HTML5, Mobile, Truck",
    "thumb": "https://img.gamemonetize.com/b5sdqnlqam9cqb6kbona6flqh8tq6m0h/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "57575",
    "title": "Paper Doll For Girls Dress Up",
    "description": "This is a decorating and dress-up game for girls. In the game, you have the opportunity to play the role of a fashion designer and choose a variety of different outfits, hairstyles, and accessories for the cute paper dolls.",
    "instructions": "Mouse click or tap to play ",
    "url": "https://html5.gamemonetize.com/dv93rn471aq2m0mcdyn3wcraxfxpco1x/",
    "category": "Girls",
    "tags": "1 Player, Dress Up, Makeover",
    "thumb": "https://img.gamemonetize.com/dv93rn471aq2m0mcdyn3wcraxfxpco1x/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "52664",
    "title": "Offroad Mountain Driving 2024",
    "description": "Behind the wheel of powerful offroad vehicles, players must use their driving skills to conquer the wild landscapes. Each level presents unique obstacles and weather conditions, from muddy tracks to snowy passes, demanding adaptability and strategic navigation. The game features a variety of vehicles, each with customizable options to enhance performance in specific terrains. Website Developer <a href='https://www.kizi10.org/'>https://www.kizi10.org/</a>",
    "instructions": "Controll the car with WASD DRIVE F to nitro ",
    "url": "https://html5.gamemonetize.com/grnjvd7zlbj5ns8v2y3gx724h8bpsqyt/",
    "category": "Action",
    "tags": "Driving, Forest, mountain, offroad",
    "thumb": "https://img.gamemonetize.com/grnjvd7zlbj5ns8v2y3gx724h8bpsqyt/512x384.jpg",
    "width": "800",
    "height": "600"
  }
]
